tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_exti.h
/**
  * @brief EXTI_FTSR Register Bit Definition
  */
#define  EXTI_FTSR_TR0_Pos                        (0)
#define  EXTI_FTSR_TR0_Msk                        (0x01U << EXTI_FTSR_TR0_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR1_Pos                        (1)
#define  EXTI_FTSR_TR1_Msk                        (0x01U << EXTI_FTSR_TR1_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR2_Pos                        (2)
#define  EXTI_FTSR_TR2_Msk                        (0x01U << EXTI_FTSR_TR2_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR3_Pos                        (3)
#define  EXTI_FTSR_TR3_Msk                        (0x01U << EXTI_FTSR_TR3_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR4_Pos                        (4)
#define  EXTI_FTSR_TR4_Msk                        (0x01U << EXTI_FTSR_TR4_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR5_Pos                        (5)
#define  EXTI_FTSR_TR5_Msk                        (0x01U << EXTI_FTSR_TR5_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR6_Pos                        (6)
#define  EXTI_FTSR_TR6_Msk                        (0x01U << EXTI_FTSR_TR6_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR7_Pos                        (7)
#define  EXTI_FTSR_TR7_Msk                        (0x01U << EXTI_FTSR_TR7_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR8_Pos                        (8)
#define  EXTI_FTSR_TR8_Msk                        (0x01U << EXTI_FTSR_TR8_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR9_Pos                        (9)
#define  EXTI_FTSR_TR9_Msk                        (0x01U << EXTI_FTSR_TR9_Pos)                      /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR10_Pos                       (10)
#define  EXTI_FTSR_TR10_Msk                       (0x01U << EXTI_FTSR_TR10_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR11_Pos                       (11)
#define  EXTI_FTSR_TR11_Msk                       (0x01U << EXTI_FTSR_TR11_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR12_Pos                       (12)
#define  EXTI_FTSR_TR12_Msk                       (0x01U << EXTI_FTSR_TR12_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR13_Pos                       (13)
#define  EXTI_FTSR_TR13_Msk                       (0x01U << EXTI_FTSR_TR13_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR14_Pos                       (14)
#define  EXTI_FTSR_TR14_Msk                       (0x01U << EXTI_FTSR_TR14_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR15_Pos                       (15)
#define  EXTI_FTSR_TR15_Msk                       (0x01U << EXTI_FTSR_TR15_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR16_Pos                       (16)
#define  EXTI_FTSR_TR16_Msk                       (0x01U << EXTI_FTSR_TR16_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR17_Pos                       (17)
#define  EXTI_FTSR_TR17_Msk                       (0x01U << EXTI_FTSR_TR17_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR18_Pos                       (18)
#define  EXTI_FTSR_TR18_Msk                       (0x01U << EXTI_FTSR_TR18_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR19_Pos                       (19)
#define  EXTI_FTSR_TR19_Msk                       (0x01U << EXTI_FTSR_TR19_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR20_Pos                       (20)
#define  EXTI_FTSR_TR20_Msk                       (0x01U << EXTI_FTSR_TR20_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR21_Pos                       (21)
#define  EXTI_FTSR_TR21_Msk                       (0x01U << EXTI_FTSR_TR21_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR22_Pos                       (22)
#define  EXTI_FTSR_TR22_Msk                       (0x01U << EXTI_FTSR_TR22_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR23_Pos                       (23)
#define  EXTI_FTSR_TR23_Msk                       (0x01U << EXTI_FTSR_TR23_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR24_Pos                       (24)
#define  EXTI_FTSR_TR24_Msk                       (0x01U << EXTI_FTSR_TR24_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR25_Pos                       (25)
#define  EXTI_FTSR_TR25_Msk                       (0x01U << EXTI_FTSR_TR25_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR26_Pos                       (26)
#define  EXTI_FTSR_TR26_Msk                       (0x01U << EXTI_FTSR_TR26_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR27_Pos                       (27)
#define  EXTI_FTSR_TR27_Msk                       (0x01U << EXTI_FTSR_TR27_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR28_Pos                       (28)
#define  EXTI_FTSR_TR28_Msk                       (0x01U << EXTI_FTSR_TR28_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR29_Pos                       (29)
#define  EXTI_FTSR_TR29_Msk                       (0x01U << EXTI_FTSR_TR29_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR30_Pos                       (30)
#define  EXTI_FTSR_TR30_Msk                       (0x01U << EXTI_FTSR_TR30_Pos)                     /*!<interrupt or event trigger polarity*/
#define  EXTI_FTSR_TR31_Pos                       (31)
#define  EXTI_FTSR_TR31_Msk                       (0x01U << EXTI_FTSR_TR31_Pos)                     /*!<interrupt or event trigger polarity*/

/**
  * @brief EXTI_SWIER Register Bit Definition
  */
#define  EXTI_SWIER_SWIER0_Pos                    (0)
#define  EXTI_SWIER_SWIER0_Msk                    (0x01U << EXTI_SWIER_SWIER0_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER1_Pos                    (1)
#define  EXTI_SWIER_SWIER1_Msk                    (0x01U << EXTI_SWIER_SWIER1_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER2_Pos                    (2)
#define  EXTI_SWIER_SWIER2_Msk                    (0x01U << EXTI_SWIER_SWIER2_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER3_Pos                    (3)
#define  EXTI_SWIER_SWIER3_Msk                    (0x01U << EXTI_SWIER_SWIER3_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER4_Pos                    (4)
#define  EXTI_SWIER_SWIER4_Msk                    (0x01U << EXTI_SWIER_SWIER4_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER5_Pos                    (5)
#define  EXTI_SWIER_SWIER5_Msk                    (0x01U << EXTI_SWIER_SWIER5_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER6_Pos                    (6)
#define  EXTI_SWIER_SWIER6_Msk                    (0x01U << EXTI_SWIER_SWIER6_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER7_Pos                    (7)
#define  EXTI_SWIER_SWIER7_Msk                    (0x01U << EXTI_SWIER_SWIER7_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER8_Pos                    (8)
#define  EXTI_SWIER_SWIER8_Msk                    (0x01U << EXTI_SWIER_SWIER8_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER9_Pos                    (9)
#define  EXTI_SWIER_SWIER9_Msk                    (0x01U << EXTI_SWIER_SWIER9_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER10_Pos                   (10)
#define  EXTI_SWIER_SWIER10_Msk                   (0x01U << EXTI_SWIER_SWIER10_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER11_Pos                   (11)
#define  EXTI_SWIER_SWIER11_Msk                   (0x01U << EXTI_SWIER_SWIER11_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER12_Pos                   (12)
#define  EXTI_SWIER_SWIER12_Msk                   (0x01U << EXTI_SWIER_SWIER12_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER13_Pos                   (13)
#define  EXTI_SWIER_SWIER13_Msk                   (0x01U << EXTI_SWIER_SWIER13_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER14_Pos                   (14)
#define  EXTI_SWIER_SWIER14_Msk                   (0x01U << EXTI_SWIER_SWIER14_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER15_Pos                   (15)
#define  EXTI_SWIER_SWIER15_Msk                   (0x01U << EXTI_SWIER_SWIER15_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER16_Pos                   (16)
#define  EXTI_SWIER_SWIER16_Msk                   (0x01U << EXTI_SWIER_SWIER16_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER17_Pos                   (17)
#define  EXTI_SWIER_SWIER17_Msk                   (0x01U << EXTI_SWIER_SWIER17_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER18_Pos                   (18)
#define  EXTI_SWIER_SWIER18_Msk                   (0x01U << EXTI_SWIER_SWIER18_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER19_Pos                   (19)
#define  EXTI_SWIER_SWIER19_Msk                   (0x01U << EXTI_SWIER_SWIER19_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER20_Pos                   (20)
#define  EXTI_SWIER_SWIER20_Msk                   (0x01U << EXTI_SWIER_SWIER20_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER21_Pos                   (21)
#define  EXTI_SWIER_SWIER21_Msk                   (0x01U << EXTI_SWIER_SWIER21_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER22_Pos                   (22)
#define  EXTI_SWIER_SWIER22_Msk                   (0x01U << EXTI_SWIER_SWIER22_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER23_Pos                   (23)
#define  EXTI_SWIER_SWIER23_Msk                   (0x01U << EXTI_SWIER_SWIER23_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER24_Pos                   (24)
#define  EXTI_SWIER_SWIER24_Msk                   (0x01U << EXTI_SWIER_SWIER24_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER25_Pos                   (25)
#define  EXTI_SWIER_SWIER25_Msk                   (0x01U << EXTI_SWIER_SWIER25_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER26_Pos                   (26)
#define  EXTI_SWIER_SWIER26_Msk                   (0x01U << EXTI_SWIER_SWIER26_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER27_Pos                   (27)
#define  EXTI_SWIER_SWIER27_Msk                   (0x01U << EXTI_SWIER_SWIER27_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER28_Pos                   (28)
#define  EXTI_SWIER_SWIER28_Msk                   (0x01U << EXTI_SWIER_SWIER28_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER29_Pos                   (29)
#define  EXTI_SWIER_SWIER29_Msk                   (0x01U << EXTI_SWIER_SWIER29_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER30_Pos                   (30)
#define  EXTI_SWIER_SWIER30_Msk                   (0x01U << EXTI_SWIER_SWIER30_Pos)                 /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER31_Pos                   (31)
#define  EXTI_SWIER_SWIER31_Msk                   (0x01U << EXTI_SWIER_SWIER31_Pos)                 /*!<software interrupt or event enable*/

/**
  * @brief EXTI_PR Register Bit Definition
  */
#define  EXTI_PR_PR0_Pos                          (0)
#define  EXTI_PR_PR0_Msk                          (0x01U << EXTI_PR_PR0_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR1_Pos                          (1)
#define  EXTI_PR_PR1_Msk                          (0x01U << EXTI_PR_PR1_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR2_Pos                          (2)
#define  EXTI_PR_PR2_Msk                          (0x01U << EXTI_PR_PR2_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR3_Pos                          (3)
#define  EXTI_PR_PR3_Msk                          (0x01U << EXTI_PR_PR3_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR4_Pos                          (4)
#define  EXTI_PR_PR4_Msk                          (0x01U << EXTI_PR_PR4_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR5_Pos                          (5)
#define  EXTI_PR_PR5_Msk                          (0x01U << EXTI_PR_PR5_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR6_Pos                          (6)
#define  EXTI_PR_PR6_Msk                          (0x01U << EXTI_PR_PR6_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR7_Pos                          (7)
#define  EXTI_PR_PR7_Msk                          (0x01U << EXTI_PR_PR7_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR8_Pos                          (8)
#define  EXTI_PR_PR8_Msk                          (0x01U << EXTI_PR_PR8_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR9_Pos                          (9)
#define  EXTI_PR_PR9_Msk                          (0x01U << EXTI_PR_PR9_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR10_Pos                         (10)
#define  EXTI_PR_PR10_Msk                         (0x01U << EXTI_PR_PR10_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR11_Pos                         (11)
#define  EXTI_PR_PR11_Msk                         (0x01U << EXTI_PR_PR11_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR12_Pos                         (12)
#define  EXTI_PR_PR12_Msk                         (0x01U << EXTI_PR_PR12_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR13_Pos                         (13)
#define  EXTI_PR_PR13_Msk                         (0x01U << EXTI_PR_PR13_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR14_Pos                         (14)
#define  EXTI_PR_PR14_Msk                         (0x01U << EXTI_PR_PR14_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR15_Pos                         (15)
#define  EXTI_PR_PR15_Msk                         (0x01U << EXTI_PR_PR15_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR16_Pos                         (16)
#define  EXTI_PR_PR16_Msk                         (0x01U << EXTI_PR_PR16_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR17_Pos                         (17)
#define  EXTI_PR_PR17_Msk                         (0x01U << EXTI_PR_PR17_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR18_Pos                         (18)
#define  EXTI_PR_PR18_Msk                         (0x01U << EXTI_PR_PR18_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR19_Pos                         (19)
#define  EXTI_PR_PR19_Msk                         (0x01U << EXTI_PR_PR19_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR20_Pos                         (20)
#define  EXTI_PR_PR20_Msk                         (0x01U << EXTI_PR_PR20_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR21_Pos                         (21)
#define  EXTI_PR_PR21_Msk                         (0x01U << EXTI_PR_PR21_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR22_Pos                         (22)
#define  EXTI_PR_PR22_Msk                         (0x01U << EXTI_PR_PR22_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR23_Pos                         (23)
#define  EXTI_PR_PR23_Msk                         (0x01U << EXTI_PR_PR23_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR24_Pos                         (24)
#define  EXTI_PR_PR24_Msk                         (0x01U << EXTI_PR_PR24_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR25_Pos                         (25)
#define  EXTI_PR_PR25_Msk                         (0x01U << EXTI_PR_PR25_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR26_Pos                         (26)
#define  EXTI_PR_PR26_Msk                         (0x01U << EXTI_PR_PR26_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR27_Pos                         (27)
#define  EXTI_PR_PR27_Msk                         (0x01U << EXTI_PR_PR27_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR28_Pos                         (28)
#define  EXTI_PR_PR28_Msk                         (0x01U << EXTI_PR_PR28_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR29_Pos                         (29)
#define  EXTI_PR_PR29_Msk                         (0x01U << EXTI_PR_PR29_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR30_Pos                         (30)
#define  EXTI_PR_PR30_Msk                         (0x01U << EXTI_PR_PR30_Pos)                       /*!<trigger pending bit*/
#define  EXTI_PR_PR31_Pos                         (31)
#define  EXTI_PR_PR31_Msk                         (0x01U << EXTI_PR_PR31_Pos)                       /*!<trigger pending bit*/


#endif

